In [3]:
import numpy as np
import pandas as pd

In [11]:
df = pd.read_csv("03/input.txt", header=None, dtype=[('0', 'str')])
df.head()

              0
0  110000000001
1  010011111011
2  111000011110
3  110101011110
4  100000010100

In [20]:
df.shape

(1000, 1)

In [17]:
ddf = pd.DataFrame(df[0].apply(lambda x: list(x)).to_list())
ddf.head()

  0  1  2  3  4  5  6  7  8  9  10 11
0  1  1  0  0  0  0  0  0  0  0  0  1
1  0  1  0  0  1  1  1  1  1  0  1  1
2  1  1  1  0  0  0  0  1  1  1  1  0
3  1  1  0  1  0  1  0  1  1  1  1  0
4  1  0  0  0  0  0  0  1  0  1  0  0

In [21]:
ddf.shape

(1000, 12)

In [18]:
ddft = ddf.transpose()
ddft.head()

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,1,0,1,1,1,0,1,0,1,0,...,0,0,0,0,0,0,1,1,0,1
1,1,1,1,1,0,0,1,1,0,1,...,1,0,0,1,0,0,1,0,0,0
2,0,0,1,0,0,0,0,1,1,1,...,1,0,0,1,0,1,0,1,1,0
3,0,0,0,1,0,1,1,1,0,0,...,1,0,1,1,1,0,1,1,1,1
4,0,1,0,0,0,0,0,0,0,0,...,0,1,0,1,0,1,0,1,0,1

In [44]:
ddft.shape[1]

1000

In [22]:
ddft.shape

(12, 1000)

In [25]:
ones_zeros = ddft.apply(pd.Series.value_counts, axis=1)
print(ones_zeros.shape)
ones_zeros.head()

(12, 2)

     0    1
0  484  516
1  504  496
2  492  508
3  504  496
4  511  489

In [31]:
ones_zeros['gamma'] = np.where(ones_zeros['0'] > ones_zeros['1'], 0, 1)
ones_zeros['epsilon'] = np.where(ones_zeros['0'] < ones_zeros['1'], 0, 1)
ones_zeros.head()

     0    1  gamma  epsilon
0  484  516      1        0
1  504  496      0        1
2  492  508      1        0
3  504  496      0        1
4  511  489      0        1

In [34]:
ones_zeros.shape

(12, 4)

In [40]:
gamma = int(''.join(str(n) for n in ones_zeros['gamma'].to_list()), 2)
epsilon = int(''.join(str(n) for n in ones_zeros['epsilon'].to_list()), 2)
print(gamma, epsilon)

2601 1494

In [41]:
gamma*epsilon

3885894

In [54]:
oxygen = ddf.copy()
col = 0
while len(oxygen) > 1:
    if oxygen[col].value_counts()['1'] >= oxygen[col].value_counts()['0']:
        oxygen.drop(oxygen[oxygen[col] == '0'].index, inplace=True)
    else: oxygen.drop(oxygen[oxygen[col] == '1'].index, inplace=True)
    col += 1
oxygen.head()

    0  1  2  3  4  5  6  7  8  9  10 11
579  1  1  1  0  1  0  1  1  1  1  1  1

In [55]:
scrubber = ddf.copy()
col = 0
while len(scrubber) > 1:
    if scrubber[col].value_counts()['1'] >= scrubber[col].value_counts()['0']:
        scrubber.drop(scrubber[scrubber[col] == '1'].index, inplace=True)
    else: scrubber.drop(scrubber[scrubber[col] == '0'].index, inplace=True)
    col += 1
scrubber.head()

   0  1  2  3  4  5  6  7  8  9  10 11
83  0  1  0  0  1  0  0  0  0  1  1  1

In [56]:
oxy = int(''.join(str(n) for n in oxygen.iloc[0].to_list()), 2)
scr = int(''.join(str(n) for n in scrubber.iloc[0].to_list()), 2)
print(oxy, scr)

3775 1159

In [57]:
oxy*scr

4375225